{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 30, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_size": [5, 5], "batch_input_shape": [null, 1, 28, 28], "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_first", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"filters": 15, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activation": "relu", "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_first", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "relu", "units": 128, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "relu", "units": 50, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "softmax", "units": 10, "trainable": true, "bias_regularizer": null}}], "keras_version": "2.0.4", "backend": "tensorflow"}